/**
 *******************************************************************************
 * @file    triggers.h
 * @brief   输入信息的触发器用轻量状态机
 *******************************************************************************
 * @attention
 *
 * none
 *
 *******************************************************************************
 * @note
 *
 * level III
 *
 *******************************************************************************
 * @author  MekLi
 * @date    2026/2/9
 * @version 1.0
 *******************************************************************************
 */


/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef INFANTRY_CHASSIS_TRIGGERS_H
#define INFANTRY_CHASSIS_TRIGGERS_H



/*-------- 1. includes and imports -----------------------------------------------------------------------------------*/




/*-------- 2. enum and define ----------------------------------------------------------------------------------------*/

enum class TriggerState {
    None,       // 未触发
    Started,    // 刚开始 (如按下瞬间)
    Ongoing,    // 进行中 (如长按中)
    Triggered,  // 成功触发 (如长按时间到了，或者双击完成了)
    Canceled    // 失败/取消
};



/*-------- 3. interface ----------------------------------------------------------------------------------------------*/

class InputTrigger {
public:
    virtual ~InputTrigger() = default;

    // 核心逻辑：输入当前值和时间差，返回状态
    virtual TriggerState update(float value, float delta_time) = 0;

    // 重置状态
    virtual void reset() { m_timer = 0; }

protected:
    float m_timer = 0;
    // 阈值常量
    static constexpr float THRESHOLD = 0.5f;
};



/*-------- 4. decorator ----------------------------------------------------------------------------------------------*/





/*-------- 5. factories ----------------------------------------------------------------------------------------------*/





#endif /*INFANTRY_CHASSIS_TRIGGERS_H*/
